In [2]:
import pandas as pd 
import numpy as np

In [4]:
df = pd.read_csv("/Users/anand/Desktop/Machine Learning/DataSet/Online Sales Data.csv")
# fetch the first 5 row 
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [5]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    240 non-null    int64
 1   Date              240 non-null    object
 2   Product Category  240 non-null    object
 3   Product Name      240 non-null    object
 4   Units Sold        240 non-null    int64
 5   Unit Price        240 non-null    float64
 6   Total Revenue     240 non-null    float64
 7   Region            240 non-null    object
 8   Payment Method    240 non-null    object
dtypes: float64(2), int64(2), object(5)
memory usage: 17.0+ KB

In [9]:
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [13]:
# Handling Missing Value
# df.isnull() # it means that if the dataset is False then it means that there is no missing value
# df.isnull().any(axis = 1) 
df.isnull().sum() # It means that there is no missing value in the data set

Transaction ID      0
Date                0
Product Category    0
Product Name        0
Units Sold          0
Unit Price          0
Total Revenue       0
Region              0
Payment Method      0
dtype: int64

In [15]:
# Renaming the Columns 
df = df.rename(columns={'Date' : 'Transaction_Date'})
df.head(2)

,Transaction ID,Transaction_Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal

In [16]:
df.dtypes

Transaction ID        int64
Transaction_Date     object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [28]:
# Changing the data TYpes of the Data Set 
df['Unit_Price_New '] = df['Unit Price'].astype(int)
df.head(2)

,Transaction ID,Transaction_Date,Product Category,Product Name,Unit Price,Total Revenue,Region,Payment Method,Unit_Price_New,Units Sold_New
0,10001,2024-01-01,Electronics,iPhone 14 Pro,999.99,1999.98,North America,Credit Card,999,4
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,499.99,499.99,Europe,PayPal,499,2

In [34]:
# df['Units Sold_New'] = df['Units Sold'].apply(lambda x : x*2) # applied the changes 
# df.drop('Unit Sold' , axis = 1 , inplace = True ) droped the old and added the new 
df.head()
# We can able to see the Units Sold_New at the last column

,Transaction ID,Transaction_Date,Product Category,Product Name,Unit Price,Total Revenue,Region,Payment Method,Unit_Price_New,Units Sold_New
0,10001,2024-01-01,Electronics,iPhone 14 Pro,999.99,1999.98,North America,Credit Card,999,4
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,499.99,499.99,Europe,PayPal,499,2
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,69.99,209.97,Asia,Debit Card,69,6
3,10004,2024-01-04,Books,The Da Vinci Code,15.99,63.96,North America,Credit Card,15,8
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,89.99,89.99,Europe,PayPal,89,2

In [43]:
# Data Aggregation and grouping 
grouped_mean_df = df.groupby('Product Category')['Unit Price'].mean()
grouped_mean_df

Product Category
Beauty Products     61.6230
Books               16.1530
Clothing            67.5365
Electronics        691.5915
Home Appliances    320.1855
Sports             261.2840
Name: Unit Price, dtype: float64

In [46]:
# Added the groupby using the 2 different cat to make the prediction
df.groupby(['Product Category' , 'Product Name'])['Payment Method'].sum()

Product Category  Product Name
Beauty Products   Anastasia Beverly Hills Brow Wiz                    PayPal
                  Biore UV Aqua Rich Watery Essence Sunscreen         PayPal
                  Caudalie Vinoperfect Radiance Serum                 PayPal
                  CeraVe Hydrating Facial Cleanser                    PayPal
                  Chanel No. 5 Perfume                                PayPal
                                                                    ...
Sports            Yeti Rambler 20 oz Tumbler                     Credit Card
                  Yeti Rambler Bottle                            Credit Card
                  Yeti Rambler Tumbler                           Credit Card
                  Yeti Roadie 24 Cooler                          Credit Card
                  Yeti Tundra Haul Portable Wheeled Cooler       Credit Card
Name: Payment Method, Length: 234, dtype: object

In [52]:
# Aggregate multiple functions
grouped_by_aggregate = df.groupby('Product Name')['Total Revenue'].agg(['mean' , 'sum' , 'count'])
grouped_by_aggregate.tail(10)

                                                       mean      sum  count
Product Name
YETI Tundra 65 Cooler                                349.99   349.99      1
Yeti Rambler 20 oz Tumbler                            59.98    59.98      1
Yeti Rambler Bottle                                  149.97   149.97      1
Yeti Rambler Tumbler                                 239.94   239.94      1
Yeti Roadie 24 Cooler                                199.99   199.99      1
Yeti Tundra Haul Portable Wheeled Cooler             399.99   399.99      1
Youth to the People Superfood Antioxidant Cleanser    36.00    36.00      1
Zara Summer Dress                                    179.97   179.97      1
iPhone 14 Pro                                       1999.98  1999.98      1
iRobot Braava Jet M6                                 449.99   449.99      1